Операторы, переменные, типы данных, условия.

Задача 4 (2 балла, однобальные не закидываю):
Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.
Формат ввода, который используют Малевийцы:
треугольник
a
b
c
Решение:
room = input()
if room == "треугольник":
    a = float(input())
    b = float(input())
    c = float(input())
    p = (a+b+c)/2
    print((p*(p-a)*(p-b)*(p-c))**0.5)
if room == "прямоугольник":
    a = float(input())
    b = float(input())
    print(a*b)
if room == "круг":
    r = float(input())
    print(3.14*r**2)


Задача 5
Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три строки сначала максимальное, потом минимальное, после чего оставшееся число.
На ввод могут подаваться и повторяющиеся числа.
Sample Input 1:
8
2
14

Решение:
a = sorted(list((int(input()) for _ in range(3))), reverse=True)
print(max(a), min(a),  sep = "\n")
a.remove(max(a))
a.remove(min(a))
print(*a) # можно без сортировки и не разворачивать в последнем принте, это я для сея делал
