Операторы, переменные, типы данных, условия.

Задача 4 (2 балла, однобальные не закидываю):
Жители страны Малевии часто экспериментируют с планировкой комнат. Комнаты бывают треугольные, прямоугольные и круглые. Чтобы быстро вычислять жилплощадь, требуется написать программу, на вход которой подаётся тип фигуры комнаты и соответствующие параметры, которая бы выводила площадь получившейся комнаты.
Для числа π в стране Малевии используют значение 3.14.
Формат ввода, который используют Малевийцы:
треугольник
a
b
c
Решение:
room = input()
if room == "треугольник":
    a = float(input())
    b = float(input())
    c = float(input())
    p = (a+b+c)/2
    print((p*(p-a)*(p-b)*(p-c))**0.5)
if room == "прямоугольник":
    a = float(input())
    b = float(input())
    print(a*b)
if room == "круг":
    r = float(input())
    print(3.14*r**2)


Задача 5
Напишите программу, которая получает на вход три целых числа, по одному числу в строке, и выводит на консоль в три строки сначала максимальное, потом минимальное, после чего оставшееся число.
На ввод могут подаваться и повторяющиеся числа.
Sample Input 1:
8
2
14

Решение:
a = sorted(list((int(input()) for _ in range(3))), reverse=True)
print(max(a), min(a),  sep = "\n")
a.remove(max(a))
a.remove(min(a))
print(*a) # можно без сортировки и не разворачивать в последнем принте, это я для сея делал


Задача 6 
В институте биоинформатики по офису передвигается робот. Недавно студенты из группы программистов написали для него программу, по которой робот, когда заходит в комнату, считает количество программистов в ней и произносит его вслух: "n программистов".

Для того, чтобы это звучало правильно, для каждого nn нужно использовать верное окончание слова.

Напишите программу, считывающую с пользовательского ввода целое число nn (неотрицательное), выводящее это число в консоль вместе с правильным образом изменённым словом "программист", для того, чтобы робот мог нормально общаться с людьми, например: 1 программист, 2 программиста, 5 программистов.

В комнате может быть очень много программистов. Проверьте, что ваша программа правильно обработает все случаи, как минимум до 1000 человек.

Дополнительный комментарий к условию:
Обратите внимание, что задача не так проста, как кажется на первый взгляд. Если ваше решение не проходит какой-то тест, это значит, что вы не рассмотрели какой-то из случаев входных данных (число программистов 0 \le n \le 10000≤n≤1000). Обязательно проверяйте свои решения на дополнительных значениях, а не только на тех, что приведены в условии задания.

Так как задание повышенной сложности, вручную код решений проверяться не будет. Если вы столкнулись с ошибкой в первых четырёх тестах, проверьте, что вы используете только русские символы для ответа. В остальных случаях ищите ошибку в логике работы программы.

Sample Input 1:

5
Sample Output 1:

5 программистов


Решение
number = input()
n = int(number[-2:])
# print(n)
if n // 10 == 1 or n % 10 == 0 or n % 10 in (5, 6, 7, 8, 9):
     print (number + " программистов")
elif n % 10 == 1:
     print (number + " программист")
else:
     print (number + " программиста")




Задача 7 
Паша очень любит кататься на общественном транспорте, а получая билет, сразу проверяет, счастливый ли ему попался. Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера билета.

Однако Паша очень плохо считает в уме, поэтому попросил вас написать программу, которая проверит равенство сумм и выведет "Счастливый", если суммы совпадают, и "Обычный", если суммы различны.

На вход программе подаётся строка из шести цифр.

Выводить нужно только слово "Счастливый" или "Обычный", с большой буквы.

Sample Input 1:

090234
Sample Output 1:

Счастливый



Решеине 
number = input()
number = [int(i) for i in number]
print("Счастливый" if sum(number[:3])==sum(number[3:]) else "Обычный")
